//Напишите программу, которая на вход принимает число и выдает его квадрат (число умноженное
//на само себя).

//Например:
//4 -> 16
//-3 -> 9
//-7 -> 49

int a = 2;
int result = 0;

result = a * a;
Console.WriteLine(result);

