//Напишите программу, которая на вход принимает число и выдает его квадрат (число умноженное
//на само себя).

//Например:
//4 -> 16
//-3 -> 9
//-7 -> 49

//string example = Console.ReadLine();
//int a = Convert.ToInt32(Console.ReadLine());


int a = Convert.ToInt32(Console.ReadLine());
int result = 1;

result = a * a;
Console.WriteLine(result);

